import numpy as np

# Исходный набор данных
# data = [29, 34, 19, 24, 12, 19, 14, 17, 23, 27, 17, 23, 32, 32, 19, 21, 14, 21, 32]
# data = [23, 11, 10, 12, 12, 11, 17, 10, 22, 17, 10, 14, 15, 22, 23, 11, 12, 36, 15]
# data = [30, 16, 16, 12, 20, 14, 30, 11, 21, 18, 22, 15, 22, 25, 25, 19, 14, 45, 22]
data = [29, 29, 32, 32, 30, 28, 28, 32, 29, 30, 28, 29, 29, 32, 32, 31, 28, 37, 28]

# Создаем случайные коэффициенты вокруг 0.84
np.random.seed(0)  # для воспроизводимости
coefficients = np.random.normal(0.84, 0.02, len(data))

# Создаем новый набор данных
new_data = [round(d * c) for d, c in zip(data, coefficients)]

print(new_data)